app/Models/Clients/ClientModel.php

    public function listClientById($id)
    {
        $query = $this->select('*')
            ->where('ID_CLIENTE', $id)
            ->get();
        return $query->getRowArray();
---
SELECT *
FROM `clientes`

    public function insertClient($data)
    {
        try {
            $query = $this->db->table('clientes')->insert($data);

            if ($query) {
                $clientData = $this
                    ->select("*")
                    ->orderBy('ID_CLIENTE')
                    ->get()
                    ->getResultArray();
---
INSERT INTO `clientes` (`ID_CLIENTE`, `NOMBRE_CLIENTE`, `NIT`, `TELEFONO`, `DIRECCION`, `INFORMACION`) VALUES (NULL, 'Examplee', '0000', '+1234567897', 'Carrera 13', '1')
SELECT *
FROM `clientes`
ORDER BY `ID_CLIENTE`