app/Models/Sinapptic/ModuleModel.php

SELECT `ID_MODULO`, `TITULO`, `ICONO`
FROM `modulo`
---
    public function listModules()
    {
        $query = $this->select(['ID_MODULO', 'TITULO', 'ICONO'])
            ->get();